{
  "backend/main.mo": "Actor exposing a simple healthCheck endpoint returning a healthy status.",
  "feature_evidence.json": "Feature evidence report listing enforced fixed DA logic and Tamil Nadu Hotel Rule updates with associated files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend files including styling, components, hooks, and utilities.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining steps, verification, and troubleshooting for releasing the Salary Split Calculator app.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH tokens and enforcing white backgrounds in light mode.",
  "frontend/index.html": "HTML entrypoint configuring metadata, title, and root mounting point for the app.",
  "frontend/src/App.tsx": "Root React component assembling the header, salary calculator, final salary workflow, and footer.",
  "frontend/src/components/salary/FinalSalaryWorkflow.tsx": "Final salary calculator workflow handling employee inputs, deductions, summaries, and message sharing.",
  "frontend/src/components/salary/SalarySplitCalculator.tsx": "Main salary split UI with zone selection, manual vs TN Hotel Rule modes, fixed DA handling, and component breakdowns.",
  "frontend/src/components/salary/TamilNaduHotelRuleConfig.tsx": "UI component for configuring Tamil Nadu hotel salary rules, handling basic percentage input and designation-based autofill. Computes basic and other percentage values using fixed DA and gross amounts.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders the About section with company details, feature highlights, and commitment statements. Displays a grid of feature cards and informational text blocks.",
  "frontend/src/components/sections/ContactSection.tsx": "Displays contact information including phone, address, and hours, plus a call-to-action for placing orders. Includes clickable phone links and a structured contact info grid.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with introductory text, call and contact buttons, and a scroll-to-contact handler. Highlights the company's location and core offering.",
  "frontend/src/components/sections/MachineryBlock.tsx": "Shows a grid of machinery items with images, titles, and descriptions used in processing. Highlights two main machines with supporting visuals.",
  "frontend/src/components/sections/ProcessSection.tsx": "Outlines processing steps and capabilities, then displays the machinery block. Features a step-by-step grid and a capabilities list.",
  "frontend/src/components/sections/ProductsSection.tsx": "Lists processed husk products with descriptions and applications, plus a pricing contact CTA. Renders a grid of product cards with icons and details.",
  "frontend/src/components/SiteFooter.tsx": "Footer component showing copyright text and caffeine.ai attribution.",
  "frontend/src/components/SiteHeader.tsx": "Fixed header displaying the app title and calculator icon.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity and refreshes dependent queries when the actor updates.",
  "frontend/src/hooks/useFinalSalary.ts": "Manages salary form state, validates inputs, computes final salary, and stores finalized employee entries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login, logout, and identity persistence using AuthClient.",
  "frontend/src/hooks/useSalarySplit.ts": "Handles zone‑based salary split logic, auto‑fill rules, and calculation modes for salary components.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables for light and dark modes with an OKLCH color palette.",
  "frontend/src/lib/contact.ts": "Exports the app’s contact phone number in display and dialable formats.",
  "frontend/src/lib/currency.ts": "Provides helpers to format numbers and currency values using Indian locale rules.",
  "frontend/src/lib/finalSalaryMessage.ts": "Generates formatted salary statements and creates WhatsApp and SMS deep links for employee salary messages.",
  "frontend/src/lib/hotelDesignations.ts": "Exports a comprehensive list of hotel industry job designations and its type definition.",
  "frontend/src/lib/zoneDesignationBasicConfig.ts": "Defines basic salary configuration per hotel designation and zone, including default values and fixed DA logic.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, animations, container settings, and plugins.",
  "project_state.json": "Describes the project state, existing features, and pending requests related to enforcing DA as a fixed amount."
}