{
  "backend/main.mo": "Main Motoko actor implementing user profiles, staff records, attendance data, and salary-related storage with access control enforcement.",
  "backend/migration.mo": "Migration module defining old/new actor state and initializing empty maps for user, staff, attendance, and salary data.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs with high-confidence annotations.",
  "frontend-file-summaries.txt": "Text bundle summarizing multiple frontend files, including layout sections, hooks, utilities, and styling descriptions.",
  "frontend/DEPLOYMENT.md": "Deployment runbook describing steps, checks, and procedures for deploying the Salary Split Calculator app.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH theme tokens and enforcing pure white backgrounds in light mode.",
  "frontend/index.html": "HTML entry point including metadata and script loader for the Salary Split Calculator SPA.",
  "frontend/src/App.tsx": "Main React app wiring authentication, profile setup, salary calculators, and layout components with React Query.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity hooks and handles authentication states and errors.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Displays a modal for users to enter and save profile details with validation and React Query mutation.",
  "frontend/src/components/salary/FinalSalaryWorkflow.tsx": "Implements an attendance-based salary calculation workflow with staff selection, finalization, and WhatsApp/SMS message generation.",
  "frontend/src/components/salary/SalarySplitCalculator.tsx": "Provides a salary split calculator with zone selection, manual mode, and Tamil Nadu Hotel Rule configuration.",
  "frontend/src/components/salary/TamilNaduHotelRuleConfig.tsx": "Renders configuration controls for Tamil Nadu Hotel Rule, including designation-based basic percentage and gross salary inputs.",
  "frontend/src/components/sections/AboutSection.tsx": "Shows an About section highlighting features and commitments of Radha general industries.",
  "frontend/src/components/sections/ContactSection.tsx": "Displays contact details, business hours, and a call-to-action section for inquiries and orders.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section component with scroll-to-contact behavior, call button, and location info.",
  "frontend/src/components/sections/MachineryBlock.tsx": "Displays a grid of machinery items with images, titles, and descriptions.",
  "frontend/src/components/sections/ProcessSection.tsx": "Shows workflow steps, capabilities list, and includes the machinery block.",
  "frontend/src/components/sections/ProductsSection.tsx": "Renders product cards with descriptions and applications plus a contact CTA.",
  "frontend/src/components/SiteFooter.tsx": "Footer component showing copyright and caffeine.ai attribution with theme styling.",
  "frontend/src/components/SiteHeader.tsx": "Fixed header showing app title, subtitle, and login button when authenticated.",
  "frontend/src/components/staff/StaffMasterPanel.tsx": "Form and table UI for adding and managing staff with salary components.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on change.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the caller’s user profile using the current actor.",
  "frontend/src/hooks/useFinalSalary.ts": "Manages salary form state and computes final salary values with validations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useSalarySplit.ts": "Manages salary-split state per zone with auto-calculation logic for basic pay, supporting manual and Tamil Nadu hotel rule modes.",
  "frontend/src/hooks/useStaffMaster.ts": "React Query hooks for fetching staff, adding staff, saving attendance-month data, and finalizing salary via actor methods.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark theme variables and typography for the application.",
  "frontend/src/lib/contact.ts": "Exports display and dialable versions of the application's contact phone number.",
  "frontend/src/lib/currency.ts": "Utility functions for formatting numbers and currency using Indian locale conventions.",
  "frontend/src/lib/finalSalaryMessage.ts": "Generates final salary statements and creates WhatsApp and SMS message links for employees.",
  "frontend/src/lib/hotelDesignations.ts": "Provides a comprehensive list of hotel industry job designations and its associated type.",
  "frontend/src/lib/zoneDesignationBasicConfig.ts": "Defines basic salary config types and zone‑wise designation mappings with defaults for manual and TN rule percentages.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity context providers.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, container settings, and plugin usage.",
  "project_state.json": "Stores the project’s metadata, existing features, pending feature requests, and architectural notes for the salary calculator app."
}