{
  "backend/main.mo": "Minimal Motoko actor with no defined methods.",
  "feature_evidence.json": "Feature evidence report mapping white-background UI requirements to related frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and styling details of key frontend files.",
  "frontend/DEPLOYMENT.md": "Runbook outlining steps to rebuild and deploy the website without source changes.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH color tokens and enforcing a pure white background across html, body, and root.",
  "frontend/index.html": "HTML entry point defining metadata and mounting root element for the React app.",
  "frontend/src/App.tsx": "Main React component composing all site sections and enforcing white backgrounds on layout containers.",
  "frontend/src/components/sections/AboutSection.tsx": "About section presenting company information and feature cards on a white background.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact section showing phone, address, hours, and a call-to-action panel, all styled with white backgrounds.",
  "frontend/src/components/sections/HeroSection.tsx": "Renders the landing hero section with call-to-action buttons, a scroll-to-contact handler, and location info.",
  "frontend/src/components/sections/ProcessSection.tsx": "Displays the company’s processing steps and capability list using mapped UI blocks and icons.",
  "frontend/src/components/sections/ProductsSection.tsx": "Shows a grid of processed husk product types with descriptions, applications, and a contact CTA.",
  "frontend/src/components/SiteFooter.tsx": "Footer component with company info, navigation links, contact details, and branding, all on a white background.",
  "frontend/src/components/SiteHeader.tsx": "Responsive white-background header with scroll effects, navigation links, and call button.",
  "frontend/src/hooks/useActor.ts": "Provides a React hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling identity loading, login, logout, and exposing authentication state.",
  "frontend/src/index.css": "Defines Tailwind base styles and OKLCH color tokens for light/dark themes and global typography.",
  "frontend/src/lib/contact.ts": "Exports the phone number constants for display and dialing.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider wrappers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, existing features, and a pending request related to enforcing a white background across all pages."
}