{
  "kind": "build_request",
  "title": "Make Dearness Allowance (DA) a fixed amount of Rs 8419 for all calculations",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Enforce Dearness Allowance (DA) as a fixed amount of Rs 8419 across the Salary Split Calculator for all zones and both calculation modes (Manual Entry and Tamil Nadu Hotel Rule), so DA cannot be changed by users and all computations always use DA = 8419.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Da is fixed Rs 8419 for all"
        ]
      },
      "acceptanceCriteria": [
        "In Salary Split Calculator, DA is always treated as 8419 (numeric) for Zone A/B/C/D.",
        "DA input in Manual Entry mode is read-only/disabled and displays 8419 (formatted as ₹8,419 where formatting is used).",
        "Any attempt to update DA via UI interactions does not change DA away from 8419.",
        "Reset actions restore DA to 8419 for the current zone.",
        "Salary breakdown values (DA line item and 'Other') reflect DA fixed at 8419 in both Manual Entry and Tamil Nadu Hotel Rule modes."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Tamil Nadu Hotel Rule configuration UI and validation to match fixed DA behavior, so users are not asked to configure DA as a percentage when DA is a fixed amount of 8419.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Da is fixed Rs 8419 for all"
        ]
      },
      "acceptanceCriteria": [
        "Tamil Nadu Hotel Rule Configuration no longer allows editing DA as a percentage (either remove DA Percentage input or disable it and clearly indicate DA is fixed at 8419).",
        "The rule-based calculation uses DA = 8419 and does not derive DA from a percentage of gross salary.",
        "Any displayed formulas/help text in the TN Hotel Rule section are updated to reflect DA being a fixed amount (not a percentage).",
        "Validation logic does not require/validate DA percentage totals for correctness if DA is fixed."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Do not edit files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not add new authentication methods beyond Internet Identity.",
    "Do not introduce external databases or backend services.",
    "Do not change unrelated salary features (e.g., finalized employee workflow) unless needed to support fixed DA in the Salary Split Calculator."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}