{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Dearness Allowance (DA) at Rs 8419 in Salary Split Calculator",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Force DA to a fixed Rs 8419 in Salary Split Calculator across all zones and both calculation modes, preventing any user edits and ensuring all calculations use DA = 8419.",
      "acceptanceCriteria": [
        "In Salary Split Calculator, DA is always treated as 8419 (numeric) for Zone A/B/C/D.",
        "DA input in Manual Entry mode is read-only/disabled and displays 8419 (formatted as ₹8,419 where formatting is used).",
        "Any attempt to update DA via UI interactions does not change DA away from 8419.",
        "Reset actions restore DA to 8419 for the current zone.",
        "Salary breakdown values (DA line item and 'Other') reflect DA fixed at 8419 in both Manual Entry and Tamil Nadu Hotel Rule modes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useSalarySplit.ts",
          "operation": "modify",
          "description": "Update salary split state and computations so DA is a constant 8419 across all zones/modes: make DA updates a no-op, ensure zone reset restores DA to 8419, and make calculation logic always use DA=8419 when computing breakdown and validation."
        },
        {
          "path": "frontend/src/components/salary/SalarySplitCalculator.tsx",
          "operation": "modify",
          "description": "Update the Salary Split Calculator UI so Manual Entry DA is displayed as disabled/read-only with value 8419, and ensure the breakdown and formula displays reflect DA as a fixed amount (not editable). Use shadcn-ui Input/Label components for disabled display and consistent styling; Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove/disable DA percentage configuration in Tamil Nadu Hotel Rule UI and adjust related validation/help text so TN rule calculations use a fixed DA amount of 8419.",
      "acceptanceCriteria": [
        "Tamil Nadu Hotel Rule Configuration no longer allows editing DA as a percentage (either remove DA Percentage input or disable it and clearly indicate DA is fixed at 8419).",
        "The rule-based calculation uses DA = 8419 and does not derive DA from a percentage of gross salary.",
        "Any displayed formulas/help text in the TN Hotel Rule section are updated to reflect DA being a fixed amount (not a percentage).",
        "Validation logic does not require/validate DA percentage totals for correctness if DA is fixed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/salary/TamilNaduHotelRuleConfig.tsx",
          "operation": "modify",
          "description": "Revise TN Hotel Rule configuration UI to stop asking for DA percentage: remove or disable the DA Percentage input and update helper text/formula display to state DA is fixed at 8419. Use shadcn-ui Card/Input/Alert components for the updated layout; Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useSalarySplit.ts",
          "operation": "modify",
          "description": "Adjust TN Hotel Rule mode state and validation so there is no DA percentage requirement: compute rule-based Basic from configured percentage while always using fixed DA=8419, and remove any validation that depends on Basic%+DA% totals."
        },
        {
          "path": "frontend/src/components/salary/SalarySplitCalculator.tsx",
          "operation": "modify",
          "description": "Update TN Hotel Rule breakdown labels and formula text so DA is shown as a fixed amount (8419) without a percentage, and ensure the displayed explanation no longer references DA being derived from a percentage. Use shadcn-ui Tabs/Card components already in place; Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/zoneDesignationBasicConfig.ts",
          "operation": "modify",
          "description": "Align designation-based TN rule configuration types/defaults with fixed DA behavior by removing or de-emphasizing DA percentage configuration and keeping only what is needed for Basic percentage auto-fill in TN mode."
        }
      ]
    }
  ]
}