{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Machinery showcase block in Process section with token-based colors and static images",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add an in-page “Machinery” content block within the existing Process section showing key husk-processing machines with English titles and short descriptions in a responsive grid.",
      "acceptanceCriteria": [
        "The Process section includes a clearly labeled “Machinery” block visible on the page without adding a new route.",
        "The block contains at least 3 machinery items, each with an English title and 1–2 sentence description focused on husk processing.",
        "Layout is responsive (single column on mobile, multi-column grid on wider screens)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/ProcessSection.tsx",
          "operation": "modify",
          "description": "Compose a new “Machinery” block inside the existing Process section (no new route): add a heading, intro copy, and a responsive grid rendering at least 3 machinery items (husk/dehusking machine, separator/cleaner, packing machine) with clear English titles and 1–2 sentence husk-processing descriptions."
        },
        {
          "path": "frontend/src/components/sections/MachineryBlock.tsx",
          "operation": "create",
          "description": "Create a reusable MachineryBlock component to render the Machinery heading + responsive machinery card grid; export it for composition within ProcessSection (ensure it is imported and rendered so it is not orphaned)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Style the Machinery block using existing design tokens to create a clear visual hierarchy while keeping the overall page background pure white.",
      "acceptanceCriteria": [
        "All Machinery block containers remain on white page background (no tinted/gray section backgrounds).",
        "Machinery cards use consistent token-based colors (e.g., primary for emphasis, subtle accent backgrounds) with readable contrast for text.",
        "No changes introduce non-white full-bleed backgrounds or gradients."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/MachineryBlock.tsx",
          "operation": "modify",
          "description": "Apply token-based styling to Machinery cards and content hierarchy: keep section/container background white; use existing tokens/classes (card, border, primary, accent) for card surfaces, borders, icon/image framing, titles, and body text; ensure hover/focus states do not introduce tinted section backgrounds or gradients."
        },
        {
          "path": "frontend/src/components/sections/ProcessSection.tsx",
          "operation": "modify",
          "description": "Ensure the new Machinery block placement and surrounding spacing aligns with existing Process section styling conventions and preserves the pure white background requirement across the full section."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add three static machinery images under public assets and render them in the Machinery block with English alt text.",
      "acceptanceCriteria": [
        "All required images are added under frontend/public/assets/generated and referenced directly by the Machinery block.",
        "Images are displayed with appropriate alt text in English.",
        "Build runs without missing-asset errors."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/husk-machine-01.dim_1200x800.png",
          "operation": "create",
          "description": "Add the required static image asset: frontend/public/assets/generated/husk-machine-01.dim_1200x800.png (clean flat illustration of a husk/dehusking machine with neutral background)."
        },
        {
          "path": "frontend/public/assets/generated/separator-machine-01.dim_1200x800.png",
          "operation": "create",
          "description": "Add the required static image asset: frontend/public/assets/generated/separator-machine-01.dim_1200x800.png (clean flat illustration of a grain/husk separator/cleaner machine with neutral background)."
        },
        {
          "path": "frontend/public/assets/generated/packing-machine-01.dim_1200x800.png",
          "operation": "create",
          "description": "Add the required static image asset: frontend/public/assets/generated/packing-machine-01.dim_1200x800.png (clean flat illustration of a packaging/packing machine with neutral background)."
        },
        {
          "path": "frontend/src/components/sections/MachineryBlock.tsx",
          "operation": "modify",
          "description": "Reference the static images from the public assets directory and render them in each machinery card with appropriate English alt text; ensure image sizing/cropping is consistent and responsive, and that builds do not produce missing-asset errors."
        }
      ]
    }
  ]
}