{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Hospitality payroll ledger — attendance-based salary (Rule #4) with staff master",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Implement Rule #4 attendance-based earned salary + net pay with derived Paid Days and validation.",
      "acceptanceCriteria": [
        "The UI includes numeric inputs for Present Days, Paid Leave Days, and Weekly Off Days (all default to 0).",
        "The UI displays Paid Days as a derived value and prevents Paid Days from exceeding Total Days in Month (show a clear validation error in English).",
        "Earned Salary and Net Pay update consistently using the Rule #4 formula above.",
        "Negative values are rejected for all attendance and deduction inputs with clear validation messages in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useFinalSalary.ts",
          "operation": "modify",
          "description": "Replace the current single \"workingDays\" model with Rule #4 fields (present, paidLeave, weeklyOff) and compute derived paidDays, earnedSalary = (monthlyGrossPay/totalDaysInMonth)*paidDays, and netPay = earnedSalary - (salaryAdvance + pf + esi). Add English validation that rejects negative values, and blocks paidDays > totalDaysInMonth with a clear error message."
        },
        {
          "path": "frontend/src/components/salary/FinalSalaryWorkflow.tsx",
          "operation": "modify",
          "description": "Update the final salary form UI to collect Present Days, Paid Leave Days, Weekly Off Days (defaults 0) and display derived Paid Days read-only; show validation errors using the shadcn-ui Alert component (Verify the component's usage instructions before implementing). Update summary cards and the on-screen formula text to reflect Rule #4 and Net Pay = Earned Salary − (Salary Advance + EPF + ESI)."
        },
        {
          "path": "frontend/src/lib/finalSalaryMessage.ts",
          "operation": "modify",
          "description": "Ensure message generation uses Rule #4 values (Paid Days / Total Days, Earned Salary, and Net Pay) and that all user-facing text remains in English."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add staff master management UI (create/list/select) with hotel designation list and prefill into the salary calculator form.",
      "acceptanceCriteria": [
        "Users can add a new staff member and see them appear in a staff list/table.",
        "Users can select a staff member and have the salary calculator form pre-filled with that staff member’s details.",
        "Designation selection uses the existing hotel designation list already present in the project.",
        "All staff-management user-facing labels and validation messages are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useStaffMaster.ts",
          "operation": "create",
          "description": "Create a staff-master hook to load staff list from the backend actor and add new staff records (name, optional mobile, designation, default Basic/DA/Other Allowance). Handle loading/error states in a way that can be surfaced in the UI."
        },
        {
          "path": "frontend/src/components/staff/StaffMasterPanel.tsx",
          "operation": "create",
          "description": "Add a Staff Master panel that lets users create and view staff in a table and select a staff member. Use shadcn-ui form/table primitives (e.g., Card, Input, Label, Button, Table, Select, Alert) and HOTEL_DESIGNATIONS for designation options (Verify the component's usage instructions before implementing). Ensure all labels and validation messages are in English."
        },
        {
          "path": "frontend/src/components/salary/FinalSalaryWorkflow.tsx",
          "operation": "modify",
          "description": "Wire StaffMasterPanel into the Final Salary workflow and add selection handling so choosing a staff member pre-fills the salary calculator fields (name/mobile/designation + default Basic/DA/Other Allowance) using the existing hotel designation list. Use shadcn-ui Select for staff selection if needed (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/components/auth/LoginButton.tsx",
          "operation": "create",
          "description": "Create a Login/Logout button using the existing Internet Identity hook. This supports the selected authorization component requirement to require login before showing application data. Use shadcn-ui Button styling patterns where appropriate (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/components/auth/ProfileSetupDialog.tsx",
          "operation": "create",
          "description": "Create a first-login profile setup dialog that calls getCallerUserProfile/saveCallerUserProfile and collects at least a display name (and optional email/department per backend UserProfile type). Use shadcn-ui Dialog, Input, Label, Button, and Alert components (Verify the component's usage instructions before implementing). Ensure English text."
        },
        {
          "path": "frontend/src/hooks/useCurrentUserProfile.ts",
          "operation": "create",
          "description": "Add a React Query hook to fetch the current user profile via the backend actor and expose loading states to prevent profile-setup modal flash as described by the selected authorization component. Ensure the hook is safe when the actor is not ready."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Gate staff and salary data views behind Internet Identity login (as required by the selected authorization component). Render LoginButton prominently when unauthenticated, and show ProfileSetupDialog after login when getCallerUserProfile returns null. On logout, clear cached app data via React Query client per authorization guidance."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Support Basic/DA/Other Allowance entry per staff member and derive Monthly Gross Pay for earned salary calculations.",
      "acceptanceCriteria": [
        "The form provides inputs for Basic and Other Allowance and shows DA as fixed (default 8,419) consistent with existing app behavior.",
        "The UI displays Monthly Gross Pay as a derived total (Basic + DA + Other Allowance).",
        "The attendance-based Earned Salary uses the derived Monthly Gross Pay, not a separate unrelated gross input.",
        "The UI clearly shows Gross Pay and Net Pay as separate values."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useFinalSalary.ts",
          "operation": "modify",
          "description": "Add salary component fields to the final salary form state (basic, da fixed at 8419, otherAllowance) and compute monthlyGrossPay = basic + da + otherAllowance. Ensure earned salary calculation uses monthlyGrossPay and not any legacy gross field."
        },
        {
          "path": "frontend/src/components/salary/FinalSalaryWorkflow.tsx",
          "operation": "modify",
          "description": "Update the form UI to show inputs for Basic and Other Allowance and a fixed/read-only DA (8,419). Display Monthly Gross Pay as a derived value and clearly separate Gross Pay vs Net Pay in the summary using shadcn-ui Cards/Alerts (Verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Ensure finalized employee listings always include a clearly labeled Name column and render the employee name with fallback.",
      "acceptanceCriteria": [
        "The finalized employees table has a dedicated header column labeled \"Name\" (English).",
        "Each row shows the employee’s name under the \"Name\" column.",
        "If no name is provided, the UI uses a consistent fallback label (e.g., \"Employee\") and still renders under the Name column."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/salary/FinalSalaryWorkflow.tsx",
          "operation": "modify",
          "description": "Audit and enforce that the finalized employees table (and any other finalized-record listings added during REQ-1/REQ-2/REQ-3 changes) includes a \"Name\" header and always displays the employee name under it, using the consistent fallback \"Employee\" when missing."
        },
        {
          "path": "frontend/src/lib/finalSalaryMessage.ts",
          "operation": "modify",
          "description": "Ensure any finalized employee record references in generated messages consistently include the employee name, using the same fallback label when missing."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Apply a cohesive hospitality payroll ledger theme (warm neutrals + emerald accents) across layout, forms, cards, and tables without adding features.",
      "acceptanceCriteria": [
        "Theme is applied consistently across header, forms, summary cards, and tables.",
        "Primary and accent colors avoid blue/purple and remain accessible (sufficient contrast).",
        "All user-facing text remains in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust global design tokens to a warm-neutral base with emerald primary/accent (avoiding blue/purple hues) while preserving accessibility and existing Tailwind/shadcn token wiring. Keep typography consistent and ensure tables/forms/cards inherit the updated theme cleanly."
        },
        {
          "path": "frontend/src/components/SiteHeader.tsx",
          "operation": "modify",
          "description": "Update header styling to align with the hospitality payroll ledger theme using theme tokens (bg-background, text-foreground, border-border, primary accents) instead of hard-coded white, ensuring consistent appearance with the new palette."
        },
        {
          "path": "frontend/src/components/SiteFooter.tsx",
          "operation": "modify",
          "description": "Update footer styling to align with the hospitality payroll ledger theme using theme tokens and consistent typography and borders; avoid introducing new product features."
        },
        {
          "path": "frontend/src/components/salary/FinalSalaryWorkflow.tsx",
          "operation": "modify",
          "description": "Refine spacing, table readability, and summary card styling to match the new theme (warm neutrals + emerald accents) using existing Tailwind utilities and shadcn-ui components (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/components/salary/SalarySplitCalculator.tsx",
          "operation": "modify",
          "description": "Align the Salary Split Calculator visuals (cards, alerts, table-like breakdown blocks) with the updated hospitality ledger theme using existing Tailwind utilities and shadcn-ui components (Verify the component's usage instructions before implementing)."
        }
      ]
    }
  ]
}